Tekla Open API Reference for Tekla Structures 2025
Beam Constructor
Overload List
Name | Description
Beam()
 Initializes a new instance of the Beam class. The start and end points are in the origin.
Beam(Beam.BeamTypeEnum)
 Initializes a new instance of the Beam class by using the defined type.
Beam(Point, Point)
 Initializes a new instance of the Beam class with the given start and end points.
Top
See Also
Reference
Beam Class
Tekla.Structures.Model Namespace